Autodesk.Revit.DB.Structure.RebarShapeDefinitionBySegments.AddListeningDimensionSegmentToBend(Autodesk.Revit.DB.ElementId,System.Double,System.Double,System.Int32,System.Int32,System.Int32)
Specify a dimension perpendicular to one fixed-direction segment,
referring to that segment and some other bend in the shape,
measured by a read-only parameter.
paramId:
Id of a parameter to report the length of the dimension. The parameter will be read-only
on Rebar instances.
constraintDirCoordX:
The x-coordinate of a 2D vector specifying the constraint direction.
constraintDirCoordY:
The y-coordinate of a 2D vector specifying the constraint direction.
iSegment0:
Index of the first segment (0 to NumberOfSegments - 1).
iSegment1:
Index of the second segment (0 to NumberOfSegments - 1).
iEnd1:
End (0 or 1) of the second segment.
Throws Autodesk.Revit.Exceptions.ArgumentException:
paramId is not the id of a shared parameter in the current document,
or its unit type is not Reinforcement_Length, Angle or Number.
-or-
The length of the vector (constraintDirCoordX, constraintDirCoordY) is too close to zero.
-or-
iSegment0 is not between 0 and NumberOfSegments.
-or-
Edge iSegment0 has a variable angle; it must have a fixed angle perpendicular to (constraintDirCoordX, constraintDirCoordY).
-or-
iSegment1 is not between 0 and NumberOfSegments.
-or-
iEnd1 is neither 0 nor 1.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.RebarShapeDefinitionBySegments.AddListeningDimensionBendToBend(Autodesk.Revit.DB.ElementId,System.Double,System.Double,System.Int32,System.Int32,System.Int32,System.Int32)
Specify a dimension between two bends, measured by a read-only parameter.
Remarks:
Each reference is at the outside of the bend, perpendicular to the specified segment. So the overall length of a shape with 5 segments might be defined by calling this function with iSegment0=0, iEnd0=0, iSegment1=4, iEnd1=1.
paramId:
Id of a parameter to report the length of the dimension. The parameter will be read-only
on Rebar instances.
constraintDirCoordX:
The x-coordinate of a 2D vector specifying the constraint direction.
constraintDirCoordY:
The y-coordinate of a 2D vector specifying the constraint direction.
iSegment0:
Index of the first segment (0 to NumberOfSegments - 1).
iEnd0:
End (0 or 1) of the first segment.
iSegment1:
Index of the second segment (0 to NumberOfSegments - 1).
iEnd1:
End (0 or 1) of the second segment.
Throws Autodesk.Revit.Exceptions.ArgumentException:
paramId is not the id of a shared parameter in the current document,
or its unit type is not Reinforcement_Length, Angle or Number.
-or-
The length of the vector (constraintDirCoordX, constraintDirCoordY) is too close to zero.
-or-
iSegment0 is not between 0 and NumberOfSegments.
-or-
iEnd0 is neither 0 nor 1.
-or-
iSegment1 is not between 0 and NumberOfSegments.
-or-
iEnd1 is neither 0 nor 1.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.RebarShapeDefinitionBySegments.AddListeningDimensionSegmentToSegment(Autodesk.Revit.DB.ElementId,System.Double,System.Double,System.Int32,System.Int32)
Specify a dimension perpendicular to two fixed-direction segments, measured by a read-only parameter.
Remarks:
RebarShapeDefinitionBySegments supports driving (read-write) dimensions only when they are associated with a single segment. Non-driving dimensions can involve multiple segments.
paramId:
Id of a parameter to report the length of the dimension. The parameter will be read-only
on Rebar instances.
constraintDirCoordX:
The x-coordinate of a 2D vector specifying the constraint direction.
constraintDirCoordY:
The y-coordinate of a 2D vector specifying the constraint direction.
iSegment0:
Index of the first segment (0 to NumberOfSegments - 1).
iSegment1:
Index of the second segment (0 to NumberOfSegments - 1).
Throws Autodesk.Revit.Exceptions.ArgumentException:
paramId is not the id of a shared parameter in the current document,
or its unit type is not Reinforcement_Length, Angle or Number.
-or-
The length of the vector (constraintDirCoordX, constraintDirCoordY) is too close to zero.
-or-
iSegment0 is not between 0 and NumberOfSegments.
-or-
iSegment1 is not between 0 and NumberOfSegments.
-or-
Edge iSegment0 has a variable angle; it must have a fixed angle perpendicular to (constraintDirCoordX, constraintDirCoordY).
-or-
Edge iSegment1 has a variable angle; it must have a fixed angle perpendicular to (constraintDirCoordX, constraintDirCoordY).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.RebarShapeDefinitionBySegments.AddBendVariableRadius(System.Int32,Autodesk.Revit.DB.Structure.RebarShapeVertexTurn,Autodesk.Revit.DB.Structure.RebarShapeBendAngle,Autodesk.Revit.DB.ElementId,System.Boolean)
Specify a variable-radius bend.
Remarks:
You must add a bend between each two segments.
vertexIndex:
Index of the vertex (1 to NumberOfVertices - 2).
turn:
Specify turn direction (RebarShapeVertexTurn::Left or RebarShapeVertexTurn::Right).
angle:
Specify whether the bend is acute, obtuse, etc.
paramId:
Id of a parameter driving the radius.
measureIncludingBarThickness:
If true, the radius is measured to the outside of the
bend; if false, it is measured to the inside.
Throws Autodesk.Revit.Exceptions.ArgumentException:
vertexIndex is not between 0 and NumberOfVertices.
-or-
paramId is not the id of a shared parameter in the current document,
or its unit type is not Reinforcement_Length, Angle or Number.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.Structure.RebarShapeDefinitionBySegments.RemoveParameterFromSegment(System.Int32,Autodesk.Revit.DB.ElementId)
Remove constraints from a segment.
Remarks:
This reverses the effect of any AddConstraint and SetSegmentAs180DegreeBend operations involving the specified segment and parameter.
iSegment:
Index of the segment (0 to NumberOfSegments - 1).
paramId:
Id of a parameter driving one or more constraints.
Throws Autodesk.Revit.Exceptions.ArgumentException:
iSegment is not between 0 and NumberOfSegments.
-or-
paramId is not the id of a shared parameter in the current document,
or its unit type is not Reinforcement_Length, Angle or Number.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.RebarShapeDefinitionBySegments.SetSegmentAs180DegreeBend(System.Int32,Autodesk.Revit.DB.ElementId,System.Boolean)
Indicate that a segment is a "virtual" segment introduced to describe a 180-degree bend. The radius of the bend will be driven by radiusParam.
iSegment:
Index of the segment (0 to NumberOfSegments - 1).
paramId:
Id of a parameter to drive the radius.
To obtain the id of a shared parameter,
call RebarShape.GetElementIdForExternalDefinition().
measureToOutsideOfBend:
Choose between two possibilities for the references of the radius dimension.
If true, measure to the exterior face of the bar. If false, measure to the interior face.
Throws Autodesk.Revit.Exceptions.ArgumentException:
iSegment is not between 0 and NumberOfSegments.
-or-
paramId is not the id of a shared parameter in the current document,
or its unit type is not Reinforcement_Length, Angle or Number.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.RebarShapeDefinitionBySegments.AddConstraintToSegment(System.Int32,Autodesk.Revit.DB.ElementId,System.Double,System.Double,System.Int32,System.Boolean,System.Boolean)
Add a constraint that helps determine the length of a segment.
Remarks:
The vector defined by (constraintDirCoordX, constraintDirCoordY) must have a positive dot product with the desired direction of the segment. This restriction, combined with the value of signOfZCoordOfCrossProductOfConstraintDirBySegmentDir, defines a quadrant of the plane that limits the variable-angle segment.
iSegment:
Index of the segment (0 to NumberOfSegments - 1).
paramId:
Id of a parameter to drive the constraint.
To obtain the id of a shared parameter,
call RebarShape.GetElementIdForExternalDefinition().
constraintDirCoordX:
The x-coordinate of a 2D vector specifying the constraint direction.
constraintDirCoordY:
The y-coordinate of a 2D vector specifying the constraint direction.
signOfZCoordOfCrossProductOfConstraintDirBySegmentDir:
Legal values are 1 and -1. For a fixed-direction segment, this value is ignored. For a variable-direction segment, this value is combined with the constraint length (the nonnegative value associated with 'param') to determine the direction of the segment. For example, a segment whose direction vector lies in the upper-right quadrant of the plane, and whose x-axis projected length is A and whose y-axis projected length is B, could be created by calling: AddConstraintToSegment(iSegment, paramA, 1.0, 0.0, 1, ...) AddConstraintToSegment(iSegment, paramB, 0.0, 1.0, -1, ...)
measureToOutsideOfBend0:
Choose between two possibilities for the first reference of the length dimension. If false, the reference is at the point where the bend begins; equivalently, at the projection of the bend centerpoint onto the segment. If true, the reference is moved outward by a distance equal to the bend radius plus the bar diameter; if the bend is a right angle or greater, this is equivalent to putting the reference at the outer face of the bend.
measureToOutsideOfBend1:
Choose between two possibilities for the second reference of the length dimension.
Throws Autodesk.Revit.Exceptions.ArgumentException:
iSegment is not between 0 and NumberOfSegments.
-or-
paramId is not the id of a shared parameter in the current document,
or its unit type is not Reinforcement_Length, Angle or Number.
-or-
The length of the vector (constraintDirCoordX, constraintDirCoordY) is too close to zero.
-or-
signOfZCoordOfCrossProductOfConstraintDirBySegmentDir is neither -1 nor 1.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.RebarShapeDefinitionBySegments.AddConstraintParallelToSegment(System.Int32,Autodesk.Revit.DB.ElementId,System.Boolean,System.Boolean)
Constrain the length of a segment by parameterizing its length.
iSegment:
Index of the segment (0 to NumberOfSegments - 1).
paramId:
Id of a parameter to drive the constraint. To obtain the id of a shared parameter,
call RebarShape.GetElementIdForExternalDefinition().
measureToOutsideOfBend0:
Choose between two possibilities for the first reference of the length dimension. If false, the reference is at the point where the bend begins; equivalently, at the projection of the bend centerpoint onto the segment. If true, the reference is moved outward by a distance equal to the bend radius plus the bar diameter; if the bend is a right angle or greater, this is equivalent to putting the reference at the outer face of the bend.
measureToOutsideOfBend1:
Choose between two possibilities for the second reference of the length dimension.
Throws Autodesk.Revit.Exceptions.ArgumentException:
iSegment is not between 0 and NumberOfSegments.
-or-
paramId is not the id of a shared parameter in the current document,
or its unit type is not Reinforcement_Length, Angle or Number.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null